28web-whatsapp-gateway/tests/performance/session-test-high.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 100
  scenarios:
    - name: "Criar Sessão WhatsApp - Alta Carga"
      weight: 100
      flow:
        - post:
            url: "/api/sessions"
            json:
              apiKey: "test-key-{{$randomString()}}"
            capture:
              - json: "$.sessionId"
              - json: "$.responseStatus"
              - json: "$.responseTime"